import numpy as np

# split默认平均分割
a = np.arange(12).reshape((3,4))
print(np.split(a,2, axis = 1))   # axis = 1表示行不变，列变
# array_split支持不平均分割，优先吧多的分到前面
print(np.array_split(a, 2, axis = 0))
print("----------------------------------------")

print(np.hsplit(a, 2))   # 同理，横向分割表示行不变，并且也默认平均分割
print("----------------------------------------")

# 切片：逗号前是行操作，逗号后是列操作
# 一维数组切片和python列表切片一样
# 多维矩阵
print(a[0:2])   #前两行
print(a[:, 1:3])   #所有行的第2、3列
print(a[0:, 2:])   # 第1行到最后，第3列到最后
print("----------------------------------------")

# 步长切片
print(a[::2, ::2])   # 每隔一行，每隔一列
print(a[:, ::-1])   # 反转列顺序
